#include <8051.h>

//按照規則跑
const unsigned char led[] = {
                                        0b11100111, //i = 3
                                        0b11011011, //i = 2
                                        0b10111101, //i = 1
                                        0b01111110, //i = 0
                                        0b10111101, //i = 1
                                        0b11011011  //i = 2 
                                    };

void main(){
    unsigned char i = 0;

    while (1) {
        //規則 P2 = ~((1 << i) | (1 << (7 - i)))
        // i = 3 -> P2 = ~(00011000)
        // i = 2 -> P2 = ~(00100100)
        // i = 1 -> P2 = ~(01000010)
        // i = 0 -> P2 = ~(10000001)
        // i = 1 -> P2 = ~(01000010)
        // i = 2 -> P2 = ~(00100100)
        // i = 3 -> P2 = ~(00011000)
        P2 = led[i];

        // delay
        for (unsigned char j = 0; j < 100; j++) {
            for (unsigned char k = 0; k < 255; k++) {}
        }

        if (++i == 6) i = 0;
    }
}
